MikroElektronika/core_packages/PIC/XC8/def/PIC16F15323/mcu.h
extern volatile TOSHbits_t TOSHbits __at(0x1FEF);
// bitfield macros
#define _TOSH_TOSH_POSN                                     0x0
#define _TOSH_TOSH_POSITION                                 0x0
#define _TOSH_TOSH_SIZE                                     0x8
#define _TOSH_TOSH_LENGTH                                   0x8
#define _TOSH_TOSH_MASK                                     0xFF
#define _TOSH_TOSH0_POSN                                    0x0
#define _TOSH_TOSH0_POSITION                                0x0
#define _TOSH_TOSH0_SIZE                                    0x1
#define _TOSH_TOSH0_LENGTH                                  0x1
#define _TOSH_TOSH0_MASK                                    0x1
#define _TOSH_TOSH1_POSN                                    0x1
#define _TOSH_TOSH1_POSITION                                0x1
#define _TOSH_TOSH1_SIZE                                    0x1
#define _TOSH_TOSH1_LENGTH                                  0x1
#define _TOSH_TOSH1_MASK                                    0x2
#define _TOSH_TOSH2_POSN                                    0x2
#define _TOSH_TOSH2_POSITION                                0x2
#define _TOSH_TOSH2_SIZE                                    0x1
#define _TOSH_TOSH2_LENGTH                                  0x1
#define _TOSH_TOSH2_MASK                                    0x4
#define _TOSH_TOSH3_POSN                                    0x3
#define _TOSH_TOSH3_POSITION                                0x3
#define _TOSH_TOSH3_SIZE                                    0x1
#define _TOSH_TOSH3_LENGTH                                  0x1
#define _TOSH_TOSH3_MASK                                    0x8
#define _TOSH_TOSH4_POSN                                    0x4
#define _TOSH_TOSH4_POSITION                                0x4
#define _TOSH_TOSH4_SIZE                                    0x1
#define _TOSH_TOSH4_LENGTH                                  0x1
#define _TOSH_TOSH4_MASK                                    0x10
#define _TOSH_TOSH5_POSN                                    0x5
#define _TOSH_TOSH5_POSITION                                0x5
#define _TOSH_TOSH5_SIZE                                    0x1
#define _TOSH_TOSH5_LENGTH                                  0x1
#define _TOSH_TOSH5_MASK                                    0x20
#define _TOSH_TOSH6_POSN                                    0x6
#define _TOSH_TOSH6_POSITION                                0x6
#define _TOSH_TOSH6_SIZE                                    0x1
#define _TOSH_TOSH6_LENGTH                                  0x1
#define _TOSH_TOSH6_MASK                                    0x40
#define _TOSH_TOSH7_POSN                                    0x7
#define _TOSH_TOSH7_POSITION                                0x7
#define _TOSH_TOSH7_SIZE                                    0x1
#define _TOSH_TOSH7_LENGTH                                  0x1
#define _TOSH_TOSH7_MASK                                    0x80

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// BAUD1CON<ABDEN>
extern volatile __bit                   ABDEN               __at(0x8F8);	// @ (0x11F * 8 + 0)
#define                                 ABDEN_bit           _BIT_ACCESS(BAUD1CON,0)
// BAUD1CON<ABDOVF>
extern volatile __bit                   ABDOVF              __at(0x8FF);	// @ (0x11F * 8 + 7)
#define                                 ABDOVF_bit          _BIT_ACCESS(BAUD1CON,7)
// SSP1CON2<ACKDT>
extern volatile __bit                   ACKDT               __at(0xC8D);	// @ (0x191 * 8 + 5)
#define                                 ACKDT_bit           _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ACKDT1>
extern volatile __bit                   ACKDT1              __at(0xC8D);	// @ (0x191 * 8 + 5)
#define                                 ACKDT1_bit          _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ACKEN>
extern volatile __bit                   ACKEN               __at(0xC8C);	// @ (0x191 * 8 + 4)
#define                                 ACKEN_bit           _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ACKEN1>
extern volatile __bit                   ACKEN1              __at(0xC8C);	// @ (0x191 * 8 + 4)
#define                                 ACKEN1_bit          _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0xC8E);	// @ (0x191 * 8 + 6)
#define                                 ACKSTAT_bit         _BIT_ACCESS(SSP1CON2,6)
// SSP1CON2<ACKSTAT1>
extern volatile __bit                   ACKSTAT1            __at(0xC8E);	// @ (0x191 * 8 + 6)
#define                                 ACKSTAT1_bit        _BIT_ACCESS(SSP1CON2,6)
// SSP1CON3<ACKTIM>
extern volatile __bit                   ACKTIM              __at(0xC97);	// @ (0x192 * 8 + 7)
#define                                 ACKTIM_bit          _BIT_ACCESS(SSP1CON3,7)
// ADACT<ADACT0>
extern volatile __bit                   ADACT0              __at(0x4F8);	// @ (0x9F * 8 + 0)
#define                                 ADACT0_bit          _BIT_ACCESS(ADACT,0)
// ADACT<ADACT1>
extern volatile __bit                   ADACT1              __at(0x4F9);	// @ (0x9F * 8 + 1)
#define                                 ADACT1_bit          _BIT_ACCESS(ADACT,1)
// ADACT<ADACT2>
extern volatile __bit                   ADACT2              __at(0x4FA);	// @ (0x9F * 8 + 2)
#define                                 ADACT2_bit          _BIT_ACCESS(ADACT,2)
// ADACT<ADACT3>
extern volatile __bit                   ADACT3              __at(0x4FB);	// @ (0x9F * 8 + 3)
#define                                 ADACT3_bit          _BIT_ACCESS(ADACT,3)
// ADACT<ADACT4>
extern volatile __bit                   ADACT4              __at(0x4FC);	// @ (0x9F * 8 + 4)
#define                                 ADACT4_bit          _BIT_ACCESS(ADACT,4)
// ADACTPPS<ADACTPPS0>
extern volatile __bit                   ADACTPPS0           __at(0xF618);	// @ (0x1EC3 * 8 + 0)
#define                                 ADACTPPS0_bit       _BIT_ACCESS(ADACTPPS,0)
// ADACTPPS<ADACTPPS1>
extern volatile __bit                   ADACTPPS1           __at(0xF619);	// @ (0x1EC3 * 8 + 1)
#define                                 ADACTPPS1_bit       _BIT_ACCESS(ADACTPPS,1)
// ADACTPPS<ADACTPPS2>
extern volatile __bit                   ADACTPPS2           __at(0xF61A);	// @ (0x1EC3 * 8 + 2)
#define                                 ADACTPPS2_bit       _BIT_ACCESS(ADACTPPS,2)
// ADACTPPS<ADACTPPS3>
extern volatile __bit                   ADACTPPS3           __at(0xF61B);	// @ (0x1EC3 * 8 + 3)
#define                                 ADACTPPS3_bit       _BIT_ACCESS(ADACTPPS,3)
// ADACTPPS<ADACTPPS4>
extern volatile __bit                   ADACTPPS4           __at(0xF61C);	// @ (0x1EC3 * 8 + 4)
#define                                 ADACTPPS4_bit       _BIT_ACCESS(ADACTPPS,4)
// ADACTPPS<ADACTPPS5>
extern volatile __bit                   ADACTPPS5           __at(0xF61D);	// @ (0x1EC3 * 8 + 5)
#define                                 ADACTPPS5_bit       _BIT_ACCESS(ADACTPPS,5)
// PMD2<ADCMD>
extern volatile __bit                   ADCMD               __at(0x3CC5);	// @ (0x798 * 8 + 5)
#define                                 ADCMD_bit           _BIT_ACCESS(PMD2,5)
// ADCON1<ADCS0>
extern volatile __bit                   ADCS0               __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<ADCS1>
extern volatile __bit                   ADCS1               __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<ADCS2>
extern volatile __bit                   ADCS2               __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON1,6)
// RC1STA<ADDEN>
extern volatile __bit                   ADDEN               __at(0x8EB);	// @ (0x11D * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RC1STA,3)
// ADCON1<ADFM>
extern volatile __bit                   ADFM                __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON1,7)
// FVRCON<ADFVR0>
extern volatile __bit                   ADFVR0              __at(0x4860);	// @ (0x90C * 8 + 0)
#define                                 ADFVR0_bit          _BIT_ACCESS(FVRCON,0)
// FVRCON<ADFVR1>
extern volatile __bit                   ADFVR1              __at(0x4861);	// @ (0x90C * 8 + 1)
#define                                 ADFVR1_bit          _BIT_ACCESS(FVRCON,1)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x38B8);	// @ (0x717 * 8 + 0)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,0)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x3868);	// @ (0x70D * 8 + 0)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,0)
// SSP1CON2<ADMSK1>
extern volatile __bit                   ADMSK1              __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 ADMSK1_bit          _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<ADMSK11>
extern volatile __bit                   ADMSK11             __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 ADMSK11_bit         _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<ADMSK2>
extern volatile __bit                   ADMSK2              __at(0xC8A);	// @ (0x191 * 8 + 2)
#define                                 ADMSK2_bit          _BIT_ACCESS(SSP1CON2,2)
// SSP1CON2<ADMSK21>
extern volatile __bit                   ADMSK21             __at(0xC8A);	// @ (0x191 * 8 + 2)
#define                                 ADMSK21_bit         _BIT_ACCESS(SSP1CON2,2)
// SSP1CON2<ADMSK3>
extern volatile __bit                   ADMSK3              __at(0xC8B);	// @ (0x191 * 8 + 3)
#define                                 ADMSK3_bit          _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<ADMSK31>
extern volatile __bit                   ADMSK31             __at(0xC8B);	// @ (0x191 * 8 + 3)
#define                                 ADMSK31_bit         _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<ADMSK4>
extern volatile __bit                   ADMSK4              __at(0xC8C);	// @ (0x191 * 8 + 4)
#define                                 ADMSK4_bit          _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ADMSK41>
extern volatile __bit                   ADMSK41             __at(0xC8C);	// @ (0x191 * 8 + 4)
#define                                 ADMSK41_bit         _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ADMSK5>
extern volatile __bit                   ADMSK5              __at(0xC8D);	// @ (0x191 * 8 + 5)
#define                                 ADMSK5_bit          _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ADMSK51>
extern volatile __bit                   ADMSK51             __at(0xC8D);	// @ (0x191 * 8 + 5)
#define                                 ADMSK51_bit         _BIT_ACCESS(SSP1CON2,5)
// OSCEN<ADOEN>
extern volatile __bit                   ADOEN               __at(0x448A);	// @ (0x891 * 8 + 2)
#define                                 ADOEN_bit           _BIT_ACCESS(OSCEN,2)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// OSCSTAT<ADOR>
extern volatile __bit                   ADOR                __at(0x4482);	// @ (0x890 * 8 + 2)
#define                                 ADOR_bit            _BIT_ACCESS(OSCSTAT,2)
// ADCON1<ADPREF0>
extern volatile __bit                   ADPREF0             __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 ADPREF0_bit         _BIT_ACCESS(ADCON1,0)
// ADCON1<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 ADPREF1_bit         _BIT_ACCESS(ADCON1,1)
// ADRESH<ADRESH0>
extern volatile __bit                   ADRESH0             __at(0x4E0);	// @ (0x9C * 8 + 0)
#define                                 ADRESH0_bit         _BIT_ACCESS(ADRESH,0)
// ADRESH<ADRESH1>
extern volatile __bit                   ADRESH1             __at(0x4E1);	// @ (0x9C * 8 + 1)
#define                                 ADRESH1_bit         _BIT_ACCESS(ADRESH,1)
// ADRESH<ADRESH2>
extern volatile __bit                   ADRESH2             __at(0x4E2);	// @ (0x9C * 8 + 2)
#define                                 ADRESH2_bit         _BIT_ACCESS(ADRESH,2)
// ADRESH<ADRESH3>
extern volatile __bit                   ADRESH3             __at(0x4E3);	// @ (0x9C * 8 + 3)
#define                                 ADRESH3_bit         _BIT_ACCESS(ADRESH,3)
// ADRESH<ADRESH4>
extern volatile __bit                   ADRESH4             __at(0x4E4);	// @ (0x9C * 8 + 4)
#define                                 ADRESH4_bit         _BIT_ACCESS(ADRESH,4)
// ADRESH<ADRESH5>
extern volatile __bit                   ADRESH5             __at(0x4E5);	// @ (0x9C * 8 + 5)
#define                                 ADRESH5_bit         _BIT_ACCESS(ADRESH,5)
// ADRESH<ADRESH6>
extern volatile __bit                   ADRESH6             __at(0x4E6);	// @ (0x9C * 8 + 6)
#define                                 ADRESH6_bit         _BIT_ACCESS(ADRESH,6)
// ADRESH<ADRESH7>
extern volatile __bit                   ADRESH7             __at(0x4E7);	// @ (0x9C * 8 + 7)
#define                                 ADRESH7_bit         _BIT_ACCESS(ADRESH,7)
// ADRESL<ADRESL0>
extern volatile __bit                   ADRESL0             __at(0x4D8);	// @ (0x9B * 8 + 0)
#define                                 ADRESL0_bit         _BIT_ACCESS(ADRESL,0)
// ADRESL<ADRESL1>
extern volatile __bit                   ADRESL1             __at(0x4D9);	// @ (0x9B * 8 + 1)
#define                                 ADRESL1_bit         _BIT_ACCESS(ADRESL,1)
// ADRESL<ADRESL2>
extern volatile __bit                   ADRESL2             __at(0x4DA);	// @ (0x9B * 8 + 2)
#define                                 ADRESL2_bit         _BIT_ACCESS(ADRESL,2)
// ADRESL<ADRESL3>
extern volatile __bit                   ADRESL3             __at(0x4DB);	// @ (0x9B * 8 + 3)
#define                                 ADRESL3_bit         _BIT_ACCESS(ADRESL,3)
// ADRESL<ADRESL4>
extern volatile __bit                   ADRESL4             __at(0x4DC);	// @ (0x9B * 8 + 4)
#define                                 ADRESL4_bit         _BIT_ACCESS(ADRESL,4)
// ADRESL<ADRESL5>
extern volatile __bit                   ADRESL5             __at(0x4DD);	// @ (0x9B * 8 + 5)
#define                                 ADRESL5_bit         _BIT_ACCESS(ADRESL,5)
// ADRESL<ADRESL6>
extern volatile __bit                   ADRESL6             __at(0x4DE);	// @ (0x9B * 8 + 6)
#define                                 ADRESL6_bit         _BIT_ACCESS(ADRESL,6)
// ADRESL<ADRESL7>
extern volatile __bit                   ADRESL7             __at(0x4DF);	// @ (0x9B * 8 + 7)
#define                                 ADRESL7_bit         _BIT_ACCESS(ADRESL,7)
// PIR1<ADTIF>
extern volatile __bit                   ADTIF               __at(0x3869);	// @ (0x70D * 8 + 1)
#define                                 ADTIF_bit           _BIT_ACCESS(PIR1,1)
// SSP1CON3<AHEN>
extern volatile __bit                   AHEN                __at(0xC91);	// @ (0x192 * 8 + 1)
#define                                 AHEN_bit            _BIT_ACCESS(SSP1CON3,1)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xF9C0);	// @ (0x1F38 * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xF9C1);	// @ (0x1F38 * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xF9C2);	// @ (0x1F38 * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA4>
extern volatile __bit                   ANSA4               __at(0xF9C4);	// @ (0x1F38 * 8 + 4)
#define                                 ANSA4_bit           _BIT_ACCESS(ANSELA,4)
// ANSELA<ANSA5>
extern volatile __bit                   ANSA5               __at(0xF9C5);	// @ (0x1F38 * 8 + 5)
#define                                 ANSA5_bit           _BIT_ACCESS(ANSELA,5)
// ANSELC<ANSC0>
extern volatile __bit                   ANSC0               __at(0xFA70);	// @ (0x1F4E * 8 + 0)
#define                                 ANSC0_bit           _BIT_ACCESS(ANSELC,0)
// ANSELC<ANSC1>
extern volatile __bit                   ANSC1               __at(0xFA71);	// @ (0x1F4E * 8 + 1)
#define                                 ANSC1_bit           _BIT_ACCESS(ANSELC,1)
// ANSELC<ANSC2>
extern volatile __bit                   ANSC2               __at(0xFA72);	// @ (0x1F4E * 8 + 2)
#define                                 ANSC2_bit           _BIT_ACCESS(ANSELC,2)
// ANSELC<ANSC3>
extern volatile __bit                   ANSC3               __at(0xFA73);	// @ (0x1F4E * 8 + 3)
#define                                 ANSC3_bit           _BIT_ACCESS(ANSELC,3)
// ANSELC<ANSC4>
extern volatile __bit                   ANSC4               __at(0xFA74);	// @ (0x1F4E * 8 + 4)
#define                                 ANSC4_bit           _BIT_ACCESS(ANSELC,4)
// ANSELC<ANSC5>
extern volatile __bit                   ANSC5               __at(0xFA75);	// @ (0x1F4E * 8 + 5)
#define                                 ANSC5_bit           _BIT_ACCESS(ANSELC,5)
// CWG1AS1<AS0E>
extern volatile __bit                   AS0E                __at(0x3098);	// @ (0x613 * 8 + 0)
#define                                 AS0E_bit            _BIT_ACCESS(CWG1AS1,0)
// CWG1AS1<AS1E>
extern volatile __bit                   AS1E                __at(0x3099);	// @ (0x613 * 8 + 1)
#define                                 AS1E_bit            _BIT_ACCESS(CWG1AS1,1)
// CWG1AS1<AS2E>
extern volatile __bit                   AS2E                __at(0x309A);	// @ (0x613 * 8 + 2)
#define                                 AS2E_bit            _BIT_ACCESS(CWG1AS1,2)
// CWG1AS1<AS3E>
extern volatile __bit                   AS3E                __at(0x309B);	// @ (0x613 * 8 + 3)
#define                                 AS3E_bit            _BIT_ACCESS(CWG1AS1,3)
// CWG1AS1<AS4E>
extern volatile __bit                   AS4E                __at(0x309C);	// @ (0x613 * 8 + 4)
#define                                 AS4E_bit            _BIT_ACCESS(CWG1AS1,4)
// PIE3<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x38C9);	// @ (0x719 * 8 + 1)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x3879);	// @ (0x70F * 8 + 1)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR3,1)
// SSP1STAT<BF>
extern volatile __bit                   BF                  __at(0xC78);	// @ (0x18F * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSP1STAT,0)
// SSP1STAT<BF1>
extern volatile __bit                   BF1                 __at(0xC78);	// @ (0x18F * 8 + 0)
#define                                 BF1_bit             _BIT_ACCESS(SSP1STAT,0)
// SSP1CON3<BOEN>
extern volatile __bit                   BOEN                __at(0xC94);	// @ (0x192 * 8 + 4)
#define                                 BOEN_bit            _BIT_ACCESS(SSP1CON3,4)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x4088);	// @ (0x811 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// BAUD1CON<BRG16>
extern volatile __bit                   BRG16               __at(0x8FB);	// @ (0x11F * 8 + 3)
#define                                 BRG16_bit           _BIT_ACCESS(BAUD1CON,3)
// TX1STA<BRGH>
extern volatile __bit                   BRGH                __at(0x8F2);	// @ (0x11E * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TX1STA,2)
// BSR<BSR0>
extern volatile __bit                   BSR0                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 BSR0_bit            _BIT_ACCESS(BSR,0)
// BSR<BSR1>
extern volatile __bit                   BSR1                __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 BSR1_bit            _BIT_ACCESS(BSR,1)
// BSR<BSR2>
extern volatile __bit                   BSR2                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 BSR2_bit            _BIT_ACCESS(BSR,2)
// BSR<BSR3>
extern volatile __bit                   BSR3                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 BSR3_bit            _BIT_ACCESS(BSR,3)
// BSR<BSR4>
extern volatile __bit                   BSR4                __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 BSR4_bit            _BIT_ACCESS(BSR,4)
// BSR<BSR5>
extern volatile __bit                   BSR5                __at(0x45);	// @ (0x8 * 8 + 5)
#define                                 BSR5_bit            _BIT_ACCESS(BSR,5)
// CM1CON0<C1EN>
extern volatile __bit                   C1EN                __at(0x4C87);	// @ (0x990 * 8 + 7)
#define                                 C1EN_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x4C81);	// @ (0x990 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x38C0);	// @ (0x718 * 8 + 0)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,0)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x3870);	// @ (0x70E * 8 + 0)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,0)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x4C88);	// @ (0x991 * 8 + 0)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x4C89);	// @ (0x991 * 8 + 1)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,1)
// CM1NCH<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x4C90);	// @ (0x992 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1NCH,0)
// CM1NCH<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x4C91);	// @ (0x992 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1NCH,1)
// CM1NCH<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x4C92);	// @ (0x992 * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1NCH,2)
// CM1PCH<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x4C98);	// @ (0x993 * 8 + 0)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1PCH,0)
// CM1PCH<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x4C99);	// @ (0x993 * 8 + 1)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1PCH,1)
// CM1PCH<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x4C9A);	// @ (0x993 * 8 + 2)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1PCH,2)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x4C84);	// @ (0x990 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x4C80);	// @ (0x990 * 8 + 0)
